Revit 2026 API

# TemperatureRatingTypeSetContains Method

---

Tests for the existence of a TemperatureRating type within the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual bool Contains(
	TemperatureRatingType item
)
```
```vb
Public Overridable Function Contains (
	item As TemperatureRatingType
) As Boolean
```
```cpp
public:
virtual bool Contains(
	TemperatureRatingType^ item
)
```
```fsharp
abstract Contains :
        item : TemperatureRatingType -> bool
override Contains :
        item : TemperatureRatingType -> bool
```

#### Parameters

item TemperatureRatingType
    The TemperatureRating type to be searched for.

#### Return Value

BooleanThe Contains method returns True if the TemperatureRating type is within the set, otherwise False.

#### Reference

TemperatureRatingTypeSet Class

Autodesk.Revit.DB.Electrical Namespace